import { Dimensions } from "react-native";

export const WINDOW_WIDTH = Dimensions.get("window").width;
export const WINDOW_HEIGHT = Dimensions.get("window").height;
export const MindTextIntroductionText = [
  "효준님의 마음은 지금 어둡고 외로워 보이네요.",
  "평소에는 괜찮은 것 같다가도, 이따금 가슴이 답답하고 가라앉는 느낌이 드실 거예요.",
  "괜찮아요.여기 효준님의 외로움을 담은 마음 씨앗을 받으세요.",
  "앞으로 14일 동안, 효준님이 이 씨앗을 키우게 됩니다.",
  "14일 후, 이 화분엔 어떤 꽃이 자라게 될까요?",
];

export const questionObj = {
  1: `평소에 아무렇지 않게 하던 일들이 \n귀찮게 느껴졌어요.`,
  2: "입맛이 없었어요",
  3: `가족이나 친구가 도와줘도 \n울적한 기분을 떨칠 수 없었어요.`,
  4: `무슨 일을 하든 \n정신을 집중하기가 힘들었어요.`,
  5: "특별히 힘들지 않았어요",
  6: "기분이 상당히 우울했어요.",
  7: "하는 일마다 어렵게 느껴졌어요.",
  8: "앞일이 암담하게 느껴졌어요.",
  9: `지금까지의 내 인생은 \n실패라는 생각이 들었어요.`,
  10: "적어도 다른 사람들만큼은 해냈어요.",
  11: "잠을 잘 자지 못했어요.",
  12: "알 수 없는 두려움을 느꼈어요.",
  13: "평소에 비해 말수가 줄었어요.",
  14: `세상에 홀로 있는 듯 \n외로움을 느꼈어요.`,
  15: "큰 불만 없이 생활했어요.",
  16: `사람들이 나에게 \n차갑게 대하는 것 같았어요.`,
  17: "갑자기 울음이 나왔어요",
  18: "잘 있다가도 문득 슬퍼졌어요.",
  19: `사람들이 나를 \n싫어하는 것 같았어요.`,
  20: `도무지 뭘 해나갈 \n엄두가 나지 않았어요.`,
};

export const policyText = {
  text: "본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.",
};
