import { Dimensions } from "react-native";

export const WINDOW_WIDTH = Dimensions.get("window").width;
export const WINDOW_HEIGHT = Dimensions.get("window").height;
export const MindTestIntroductionText = [
  "효준님의 마음은 지금 어둡고 외로워 보이네요.",
  "평소에는 괜찮은 것 같다가도, 이따금 가슴이 답답하고 가라앉는 느낌이 드실 거예요.",
  "괜찮아요.여기 효준님의 외로움을 담은 마음 씨앗을 받으세요.",
  "앞으로 14일 동안, 효준님이 이 씨앗을 키우게 됩니다.",
  "14일 후, 이 화분엔 어떤 꽃이 자라게 될까요?",
];

export const questionObj = {
  1: `평소에 아무렇지 않게 하던 일들이 \n귀찮게 느껴졌어요.`,
  2: "입맛이 없었어요",
  3: `가족이나 친구가 도와줘도 \n울적한 기분을 떨칠 수 없었어요.`,
  4: `무슨 일을 하든 \n정신을 집중하기가 힘들었어요.`,
  5: "특별히 힘들지 않았어요",
  6: "기분이 상당히 우울했어요.",
  7: "하는 일마다 어렵게 느껴졌어요.",
  8: "앞일이 암담하게 느껴졌어요.",
  9: `지금까지의 내 인생은 \n실패라는 생각이 들었어요.`,
  10: "적어도 다른 사람들만큼은 해냈어요.",
  11: "잠을 잘 자지 못했어요.",
  12: "알 수 없는 두려움을 느꼈어요.",
  13: "평소에 비해 말수가 줄었어요.",
  14: `세상에 홀로 있는 듯 \n외로움을 느꼈어요.`,
  15: "큰 불만 없이 생활했어요.",
  16: `사람들이 나에게 \n차갑게 대하는 것 같았어요.`,
  17: "갑자기 울음이 나왔어요",
  18: "잘 있다가도 문득 슬퍼졌어요.",
  19: `사람들이 나를 \n싫어하는 것 같았어요.`,
  20: `도무지 뭘 해나갈 \n엄두가 나지 않았어요.`,
};

export const policyText = {
  text: "본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.본 약관은 새로의 서비스 이용과 관련하여 필요한 사항을 규정합니다. 제1장 총칙 제 1 조 목적  1. 새로를 운영하는 주식회사 새로컴퍼니(이하 '회사'라고 합니다)는 아래와 같은 약관에 동의하는 이용자들에게 제공되는 인터넷서비스로, 본 약관은 이용자와 회사 사이에 본 홈페이지 이용에 관한 권리 및 의무를 규정하는 것을 목적으로 합니다.2. 홈페이지의 모든 자료는 Cero 및 자회사, 계열사 혹은 Cero Corporation에 의해 자격을 취득한 기타 이해 관계자에 의한 저작권, 등록의장, 등록상표 또는 기타 지적소유권으로 보호되고 있습니다. 3. 본 홈페이지에 포함된 자료는 이용자에게 정보 제공을 위한 목적으로만 제공됩니다. 이용자는 본 홈페이지의 내용에 대하여 어떤 방법으로도 배포, 출판, 전송, 변경, 전시, 모방작품의 창조 혹은 개발할 수 없습니다. 이용자는 회사의 권한을 보호하여야 하고, 본 홈페이지의 자료를 허가 없이 유용할 수 없습니다. 허가 없이 본 홈페이지의 내용을 유용하는 경우에 회사와 Starbucks Corporation은 이용자에게 법적, 재정적으로 가능한 기타 추가적인 배상을 청구할 수 있습니다.",
};

export const mindTestResult: { [key: string]: { [key: number]: string } } = {
  serious: {
    0: `자, 여기 OOOOOO 님의 \n 마음이 담긴 씨앗입니다. \n조심히 다뤄주세요.\n아주 여리고 연약한 씨앗이에요.\n\n이 작고 앙상한 점 하나에\n외롭고 고단한 마음이 \n고스란히 담겨 있습니다.`,
    1: `지금 마음 상태라면 \n평범한 일상 생활도 어렵게\n느껴지실 거예요.\n계속해서 부정적인 생각이 들고\n도저히 회복할 방법이 보이지\n않으실 수도 있어요.`,
    2: `그러나 분명한 사실은 \n제 아무리 어두운 밤이라도\n아침은 끝내 찾아온다는 것.\n\n지금 무엇보다 중요한 것은\n아침이 올 때까지 \n스스로를 지켜내는 일이에요.`,
    3: `자, 이 씨앗을 한 번 보세요.\nOOOOOO 님의 씨앗엔\n어둠을 물리칠\n화사함이 담겨있답니다.`,
    4: `앞으로 14일 동안\n저희가 함께할게요.\n먼저 이 씨앗을 조심히 \n화분에 심어주세요.`,
    5: `씨앗이 꽃을 피울 수록\nOOOOOO 님의 마음도\n근사하게 피어날 거예요.`,
    6: `14일 후,\n과연 이 씨앗은\n어떤 꽃으로 자라게 될까요?`,
  },
  attention: {
    0: `자, 여기 OOOOOO 님의 \n마음이 담긴 씨앗입니다.\n이런, 씨앗이 유난히 어둡네요.\n겉껍질도 당장 심어주지 않으면\n바스라질 것처럼 말라 있어요.`,
    1: `요즘 마음은 좀 어떠세요?\n괜찮다 싶다가도\n문득 마음이 답답하고 가라앉는 느낌이 드시진 않나요?`,
    2: `복잡하고 싱숭생숭한 마음이\n씨앗에 고스란히\n담겨 있는 듯 합니다.\n\n이 씨앗처럼\nOOOOOO 님의 마음도\n꾸준한 관리가 필요해보여요.`,
    3: `너무 걱정하진 마세요.\nOOOOOO 님의 씨앗은\n작고 여리지만 단단하고\n속도 꽉 차 있거든요.`,
    4: `앞으로 14일이\n정말 중요하겠어요.\n\n이 씨앗을 잘 가지고 가서\n바로 화분에 심어주세요.`,
    5: `씨앗이 꽃을 피울 수록\nOOOOOO 님의 마음도\n근사하게 피어날 거예요.`,
    6: `14일 후,\n과연 이 씨앗은\n어떤 꽃으로 자라게 될까요?`,
  },
  moderate: {
    0: `자, 여기 OOOOOO 님의\n마음이 담긴 씨앗입니다.\n겉으로 보기엔 멀쩡하지만\n조심해주세요,\n안쪽은 아직 연약하거든요.`,
    1: `특별한 관리가 필요하진 않지만\n언제라도 물러질 수 있으니\n꾸준히 살펴보는 게 좋겠어요.\n\nOOOOOO 님 마음도\n마찬가지일 거예요.`,
    2: `평소에 잘 지내다가도\n문득 이유 없는 한숨이 나오거나\n가끔 잠들기 어려운 밤이\n찾아오지 않나요?`,
    3: `엄려하실 필요는 없어요.\n\nOOOOOO 님의 마음은\n작은 어려움 정도는\n금방 이겨낼 만큼\n건강하고 튼튼하거든요.\n\n마치 이 씨앗처럼 말이죠.`,
    4: `자, 그럼 매일매일의\n마음을 돌보는 마음으로\n씨앗을 키워볼까요?\n\n이 씨앗을 바로\n화분에 심어주세요.`,
    5: `씨앗이 꽃을 피울 수록\nOOOOOO 님의 마음도\n근사하게 피어날 거예요.`,
    6: `14일 후,\n과연 이 씨앗은\n어떤 꽃으로 자라게 될까요?`,
  },
  good: {
    0: `자, 여기 OOOOOO 님의\n마음이 담긴 씨앗입니다.\n\n건강하고 속이 꽉 찬\n멋진 씨앗이네요!\n\n윤기가 흐르는 껍질까지\n보기도 좋아요.`,
    1: `OOOOOO 님은\n요즘 평온하고 만족스런\n나날을 보내고 계신가 보네요.\n\n좋아요,\n분명 이 씨앗도\n아주 멋진 꽃을 피울 거예요.`,
    2: `그렇지만 아무리 \n건강한 씨앗이라도\n혼자 자라지 않는다는 건\n알고 계시죠?\n\n우리 마음도 마찬가지입니다.\n이 건강을 오래 유지하기 위해\n잊지 않고 돌봐주어야 해요.`,
    3: `앞으로 14일,\n이 씨앗과 함께\nOOOOOO 님의 마음을\n돌보는 시간을 가져볼게요.`,
    4: `화사하게 피어날\n우리의 내일을 기대하며,\n이 씨앗을 화분에 심어주세요.`,
    5: `씨앗이 꽃을 피울 수록\nOOOOOO 님의 마음도\n근사하게 피어날 거예요.`,
    6: `14일 후,\n과연 이 씨앗은\n어떤 꽃으로 자라게 될까요?`,
  },
};
